[
    {
        "mainPlatform": "tweet",
        "summary": "The Hytale Team talk Machinima, mods, and lore.",
        "mainText": "<p class='mainTextParagraph'>Simon began the day by revealing a short cinematic made with an old version of Machinima, which Simon stated was recorded a few years ago, and confirmed the plan is to rebuild the Machinima tools after launch.</p><p class='mainTextParagraph'>\n\nAdditionally, Simon stated he gave permission for Hytale modders to release their early-access mods. Afterwards, Slikey revealed the team has a 'whole list of things missing [they] will need to add capabilities for.' Slikey then shared a thread detailing how modders and business partners enabled the team to be in a position to release Early Access next week.</p><p class='mainTextParagraph'>\n\nFinally, the Hytale Team shadow dropped a fresh blog post detailing the team's approach to narrative and lore, and how lore changed during Riot's ownership of the game, and must now be revisited -- ultimately returning to an earlier draft, while integrating some of the new with the old. One specific example is including both the New and Old Scarak designs, and including Tessa and Kyros! The blog states that lore in Exploration Mode will be uncovered almost exclusively through archaeology and discovery, and will only be light at first.</p><p class='mainTextParagraph'>\n\nFinally, a community member made a list of all the Hytale mods videos and screenshots that were shared today (final source link).</p>",
        "date": "01 08 2026",
        "tags": [
            "Simon",
            "Tweet",
            "Youtube",
            "Slikey",
            "Blogpost",
            "Early Access",
            "Modding",
            "Simon Notes",
            "Video"
        ],
        "sources": [
            {
                "1": [
                    "Hytale - Machinima Video",
                    "https://www.youtube.com/watch?v=emNCLx_WCTo"
                ]
            },
            {
                "2": [
                    "Simon - Machinima Disclaimer",
                    "https://xcancel.com/Simon_Hypixel/status/2009147774223208909?s=20"
                ]
            },
            {
                "3": [
                    "Simon - Plans to use Machinima for in-game cinematics",
                    "https://xcancel.com/Simon_Hypixel/status/2009283814275666255?s=20"
                ]
            },
            {
                "4": [
                    "Simon - Modders Sharing Work",
                    "https://xcancel.com/Simon_Hypixel/status/2009283464969757167?s=20"
                ]
            },
            {
                "5": [
                    "Slikey - List of missing things for modding",
                    "https://xcancel.com/slikey/status/2009288884878705129?s=20"
                ]
            },
            {
                "6": [
                    "Slikey - Thread - Modders/Business Partners",
                    "https://xcancel.com/slikey/status/2009323898924380412?s=20"
                ]
            },
            {
                "7": [
                    "Blog - Hytale's Lore and Philosophy",
                    "https://hytale.com/news/2026/1/a-look-at-hytale-s-lore-and-philosophy"
                ]
            },
            {
                "8": [
                    "Community - Thread of Mod videos and images",
                    "https://xcancel.com/Zeusley/status/2009286224561803397?s=20"
                ]
            }
        ]
    },
    {
        "mainPlatform": "tweet",
        "summary": "The Hytale Team talk machinima, cosmetics, combat, quests, and more.",
        "mainText": "<p class='mainTextParagraph'>Simon started the day by announcing a Hytale 'Machinima' video will be posted on YouTube on Jan. 8th, at 10 AM EST. Simon cautioned that the Machinima tools are half broken right now, but are being slowly fixed.</p><p class='mainTextParagraph'>\n\nOver on BlueSky, Thomas Frick confirmed that dwarvish style beards exist in Hytale. As for glowing cosmetics, Thomas stated that there were being considered, adding that implementation must be carefully considered as to not have most players looking similar. When asked about eyelashes, Thomas stated that eyelashes and eyelids aren't separate at the moment, but are considered for the future.</p><p class='mainTextParagraph'>\n\nWhen asked about the arrow indicator around the in-game cursor (seen during some combat clips), Propzie explained that it indicates the next swing direction, and is controllable by holding movement direction, though Simon says it might be changed to mouse-based controls later.. As for how to attack with the butt end of a mace, Propzie explain it's done by attacking while holding block. Next, Propzie explained that the shield item is only active when used with compatible gear, and is stored otherwise.</p><p class='mainTextParagraph'>\n\nSimon also revealed that quests have been removed from the game, and that a short 'lore update blog' will be published by the weekend, followed by a release TLDR blog with patch notes by launch. Additionally, Simon stated that an exact launch time for January 13th would be determined soon.</p><p class='mainTextParagraph'>\n\nFinally, Simon shared a video showcasing Hytale's in-game bug reporting and feedback tool.</p>",
        "date": "01 07 2026",
        "tags": [
            "Simon",
            "Tweet",
            "Hytale",
            "Propzie",
            "Thomas Frick",
            "Community",
            "Screenshot",
            "Tech"
        ],
        "sources": [
            {
                "1": [
                    "Simon - Machinima Announcement",
                    "https://xcancel.com/Simon_Hypixel/status/2008789196635591049?s=20"
                ]
            },
            {
                "2": [
                    "Simon - Half-Broken Machinima",
                    "https://xcancel.com/Simon_Hypixel/status/2008791118067233205?s=20"
                ]
            },
            {
                "3": [
                    "Thomas - Dwarven Beards",
                    "https://bsky.app/profile/thomasfrick.bsky.social/post/3mbtcj7d5u22e"
                ]
            },
            {
                "4": [
                    "Thomas - Glowing Cosmetics",
                    "https://bsky.app/profile/thomasfrick.bsky.social/post/3mbtuwabny22y"
                ]
            },
            {
                "5": [
                    "Thomas - Eyelash Cosmetics",
                    "https://bsky.app/profile/thomasfrick.bsky.social/post/3mbutp62f722j"
                ]
            },
            {
                "6": [
                    "Propzie - Swing Direction",
                    "https://xcancel.com/Propzie/status/2008922558607815118?s=20"
                ]
            },
            {
                "7": [
                    "Simon - Swing Direction",
                    "https://xcancel.com/Simon_Hypixel/status/2008953698836418602?s=20"
                ]
            },
            {
                "8": [
                    "Propzie - Attacking with butt-end of Mace",
                    "https://xcancel.com/Propzie/status/2008926083777769622?s=20"
                ]
            },
            {
                "9": [
                    "Propzie - Shield Slot",
                    "https://xcancel.com/Propzie/status/2008937740692582546?s=20"
                ]
            },
            {
                "10": [
                    "Simon - No Quests",
                    "https://xcancel.com/Simon_Hypixel/status/2009017475955085447?s=20"
                ]
            },
            {
                "11": [
                    "Simon - Lore and TLDR Blogs",
                    "https://xcancel.com/Simon_Hypixel/status/2009019717353394551?s=20"
                ]
            },
            {
                "12": [
                    "Simon - Exact Launch Time",
                    "https://xcancel.com/Simon_Hypixel/status/2008929702916882457?s=20"
                ]
            },
            {
                "13": [
                    "Simon - In-Game Bug Reporting",
                    "https://xcancel.com/Simon_Hypixel/status/2008920885952925914?s=20"
                ]
            }
        ]
    },
    {
        "mainPlatform": "tweet",
        "summary": "The Hytale Team talk hairstyles, PVP, and other content.",
        "mainText": "<p class='mainTextParagraph'>Thomas Frick, Hytale's Art Director, shared on Twitter that he was working on improving as many 'outdated haircuts' as possible before release. Responding to community questions and requests stemming from that post, Thomas confirmed that the team aims at being as inclusive as possible, and will keep adding more and more inclusive hairstyles from different cultures. Additionally, Thomas stated that longer hairstyles are desired, though tech issues prevent their addition, as well as mixed hair tints - though the team is exploring tech solutions to both down the line.</p><p class='mainTextParagraph'>\n\nSimon provided an update on PVP, stating that knockback had been 'fixed,' though wouldn't be properly balanced at launch. Additionally, he revealed the addition of an Health Bar toggle for servers. Furthermore, Simon revealed the addition of fruit trees to Hytale - though it is unclear what type of fruit trees now exist.</p><p class='mainTextParagraph'>\n\nResponding to questions regarding playing with friends, Simon stated that, while a Friends List won't be in the game at launch, a prototype is in the works and should be implemented in the first few months. At the moment, playing with friends is done via an invite code system.</p><p class='mainTextParagraph'>\n\nFinally, Simon shared that a few dev team members are already focused on post-launch patches and updates, adding that the team has a massive list of 'obvious' issues/updates that need to be done ASAP.</p>",
        "date": "01 06 2026",
        "tags": [
            "Simon",
            "Tweet",
            "Thomas Frick",
            "Accessibility",
            "Art",
            "Early Access",
            "Features",
            "Social System"
        ],
        "sources": [
            {
                "1": [
                    "Thomas Frick - Improving Hairstyles",
                    "https://xcancel.com/ThomasFrick/status/2008425087381184939?s=20"
                ]
            },
            {
                "2": [
                    "Thomas Frick - Inclusive Hairstyles",
                    "https://xcancel.com/ThomasFrick/status/2008440665244303453?s=20"
                ]
            },
            {
                "3": [
                    "Thomas Frick - Long Hairstyle Issues",
                    "https://xcancel.com/ThomasFrick/status/2008429047932420167?s=20"
                ]
            },
            {
                "4": [
                    "Thomas Frick - Mixing Hair Tints",
                    "https://xcancel.com/ThomasFrick/status/2008429760033014060?s=20"
                ]
            },
            {
                "5": [
                    "Simon - Knockback",
                    "https://xcancel.com/Simon_Hypixel/status/2008730081263493157?s=20"
                ]
            },
            {
                "6": [
                    "Simon - Health Bar toggle",
                    "https://xcancel.com/Simon_Hypixel/status/2008730257067831424?s=20"
                ]
            },
            {
                "7": [
                    "Simon - Fruit Trees",
                    "https://xcancel.com/Simon_Hypixel/status/2008714029741871349?s=20"
                ]
            },
            {
                "8": [
                    "Simon - Friends System",
                    "https://xcancel.com/Simon_Hypixel/status/2008730989397504417?s=20"
                ]
            },
            {
                "9": [
                    "Simon - Invite Code System",
                    "https://xcancel.com/Simon_Hypixel/status/2008731210416373791?s=20"
                ]
            },
            {
                "10": [
                    "Simon - Post-Launch Patches/Updates",
                    "https://xcancel.com/Simon_Hypixel/status/2008659495619289173?s=20"
                ]
            },
            {
                "11": [
                    "Simon - List of obvious work",
                    "https://xcancel.com/Simon_Hypixel/status/2008660971221627281?s=20"
                ]
            }
        ]
    },
    {
        "mainPlatform": "blog",
        "summary": "The Hytale Team share The Future of World Generation (World Gen V2) blog post.",
        "mainText": "<p class='mainTextParagraph'>Dan & Amber of the Hytale Team shared a glimpse into The Future of World Generation, or 'World Gen V2.' </p><p class='mainTextParagraph'>\n\nThe blog began with a brief explanation, covering the difference between World Gen V1 and World Gen V2, and briefly stating that V2 will be the primary world generator for Hytale once it is complete. The blog included many videos and screenshots showcasing World Gen V2, showcasing and explaining various features.</p><p class='mainTextParagraph'>\n\nA major 'selling point' of World Gen V2 is the node editor system, which allows <b>anyone</b> to create and modify world-gen without knowing how to code. Additionally, any world-gen edits are live-reloaded in-game to reflect any changes made, allowing creators to control terrain shape, biome transitions, materials, props, and other world generation factors.</p><p class='mainTextParagraph'>\n\nThe Team also committed to publishing first-party tutorials, guides, and documentation, and (soon enough) hire over 15 World Designers, primarily from the community.  Simon estimates that starting salaries for World Designers would be around $80K~$100K USD a year.</p>",
        "date": "01 05 2026",
        "tags": [
            "Simon",
            "Statement",
            "Blog",
            "Tweet",
            "Amber",
            "Dan",
            "Early Access",
            "Features",
            "Future Stuff",
            "Modding",
            "Simon Notes",
            "Tech",
            "World Generation"
        ],
        "sources": [
            {
                "1": [
                    "Blog - The Future of World Generation",
                    "https://hytale.com/news/2026/1/the-future-of-world-generation"
                ]
            },
            {
                "2": [
                    "Simon - Starting Salaries for World Designers",
                    "https://xcancel.com/Simon_Hypixel/status/2008219318241423865?s=20"
                ]
            }
        ]
    },
    {
        "mainPlatform": "tweet",
        "summary": "The Hytale Team talk MacOS support, new mod video, new server information, and reveal World Gen V2 Blogpost release timing.",
        "mainText": "<p class='mainTextParagraph'>The Hytale Team started the day off strong, with DevSlashNull (Hytale's Technical Producer) announcing that Hytale will ship with macOS support on January 13th, and will support any M-Series Macs. Simon revealed that he previously tested the game on a M1 Mac Mini with 8GB of RAM, and got ~60 FPS @ 1080P with a view distance a bit over 200 blocks. Separately, Slikey confirmed that Hytale will not support Intel Macs, as it would require separate maintenance and support.</p><p class='mainTextParagraph'>\n\nAround 11 AM CST, Simon shared a video showcasing a server-side mod created by a team member in their spare time, featuring top-down wave shooter style gameplay, akin to Vampire Survivors. Slikey later stated that he has a long list of limitations that are critical before mods like 'Create' can be... created, and stated he'd try to post the list some time in the next week.</p><p class='mainTextParagraph'>\n\nSlikey revealed new server information in a series of short tweets, confirming Hytale supports IPv6, does not yet have SRV records, and stated that Hytale does not currently have support for peer-to-peer custom lobbies 'yet.'</p><p class='mainTextParagraph'>\n\nPerhaps the most important news of the day came with Simon's announcement that Hytale's <b><i>World Gen V2</i></b> blog post would release tomorrow, January 5th, at 10 AM EST.</p>",
        "date": "01 04 2026",
        "tags": [
            "Simon",
            "Tweet",
            "DevSlashNull",
            "Slikey",
            "Modding",
            "Servers",
            "Tech",
            "Video"
        ],
        "sources": [
            {
                "1": [
                    "DevSlashNull - MacOS Support/Requirements",
                    "https://xcancel.com/DevSlashNulled/status/2007857668963074382?s=20"
                ]
            },
            {
                "2": [
                    "Simon - M1 Mac Mini test result",
                    "https://xcancel.com/Simon_Hypixel/status/2007873045029892398?s=20"
                ]
            },
            {
                "3": [
                    "Slikey - No support for Intel Macs",
                    "https://xcancel.com/slikey/status/2007775820320784431?s=20"
                ]
            },
            {
                "4": [
                    "Simon - Mod Gameplay Showcase",
                    "https://xcancel.com/Simon_Hypixel/status/2007888131350212658?s=20"
                ]
            },
            {
                "5": [
                    "Slikey - Mod Limitation List",
                    "https://xcancel.com/slikey/status/2007899018802958499?s=20"
                ]
            },
            {
                "6": [
                    "Slikey - IPv6 Support",
                    "https://xcancel.com/slikey/status/2007904369757556754?s=20"
                ]
            },
            {
                "7": [
                    "Slikey - No SRV records yet",
                    "https://xcancel.com/slikey/status/2007904561735094580?s=20"
                ]
            },
            {
                "8": [
                    "Slikey - No peer-to-peer custom lobbies yet",
                    "https://xcancel.com/slikey/status/2008011247174721904?s=20"
                ]
            },
            {
                "9": [
                    "Simon - World Gen V2 blog post release date",
                    "https://xcancel.com/Simon_Hypixel/status/2007978748688368006?s=20"
                ]
            }
        ]
    },
    {
        "mainPlatform": "tweet",
        "summary": "The Hytale Team talk upcoming World Gen V2.",
        "mainText": "<p class='mainTextParagraph'>Answering questions on Twitter, Simon revealed that the World Gen V2 blog post will be live by Monday (January 5th) by the latest, and reconfirmed that the new world gen will surpass anything seen in the blog game genre in terms of tech and usability. While World Gen V2 won't be used on early access launch, Simon confirmed that players can 'visit' it, and try out some of the biomes/tests the team made.</p><p class='mainTextParagraph'>\n\nSimon made a follow-up tweet, intending to temper expectations after seeing comments by the community. Simon revealed that the blog will focus mainly on the tech, tools, and prototype examples to showcase what it can do and how, and won't have major screenshots/clips of the world itself. Simon revealed that only a few biomes have been made, which he says are unfinished, though he says the new world gen is designed to enable much faster creation while giving greater control.</p>",
        "date": "01 03 2026",
        "tags": [
            "Simon",
            "Tweet",
            "World Generation"
        ],
        "sources": [
            {
                "1": [
                    "Simon - WGV2 blog status",
                    "https://xcancel.com/Simon_Hypixel/status/2007541160672195018?s=20"
                ]
            },
            {
                "2": [
                    "Simon - Surpassing other games",
                    "https://xcancel.com/Simon_Hypixel/status/2007556755291836727?s=20"
                ]
            },
            {
                "3": [
                    "Simon - Visit/test V2",
                    "https://xcancel.com/Simon_Hypixel/status/2007601133091749965?s=20"
                ]
            },
            {
                "4": [
                    "Simon - Tempering Expectations",
                    "https://xcancel.com/Simon_Hypixel/status/2007575164188606611?s=20"
                ]
            }
        ]
    },
    {
        "mainPlatform": "tweet",
        "summary": "The Hytale Team talk PVP.",
        "mainText": "<p class='mainTextParagraph'>After releasing an early look at Hytale's PVP, Simon took to Twitter to answer questions and provide details.</p><p class='mainTextParagraph'>\n\nSimon began by noting that knockback and collision are currently missing in-game, noting rendering issues with health bars and confirming they can be disabled. Simon also noted that weapons don't currently use durability, though it can be enabled, and added that (by default) players will lose some materials and durability upon death.</p><p class='mainTextParagraph'>\n\nSimon noted that the armor broke during the video, and thus only offered 50% benefits.</p><p class='mainTextParagraph'>\n\nWhen asked about spears and other weapons, Simon confirmed many additional weapon types exist in the game, but only in creative mode as they require work/special abilities. The developer also confirmed that enchantments/other improvement options for gear do not currently exist, and mentioned that a parry system and a stagger system will probably be added later on, and a grave system will likely be re-attempted in the future.</p>",
        "date": "01 01 2026",
        "tags": [
            "Simon",
            "Tweet",
            "Early Access",
            "Features",
            "Future Stuff",
            "Gameplay",
            "Simon Notes"
        ],
        "sources": [
            {
                "1": [
                    "Simon - General Notes on PVP video",
                    "https://xcancel.com/Simon_Hypixel/status/2006814867794128968?s=20"
                ]
            },
            {
                "2": [
                    "Simon - Knockback/Collision",
                    "https://xcancel.com/Simon_Hypixel/status/2006806848566182268?s=20"
                ]
            },
            {
                "3": [
                    "Simon - Health Bars",
                    "https://xcancel.com/Simon_Hypixel/status/2006808695586598997?s=20"
                ]
            },
            {
                "4": [
                    "Simon - Weapon Durability",
                    "https://xcancel.com/Simon_Hypixel/status/2006810504044724270?s=20"
                ]
            },
            {
                "5": [
                    "Simon - Death Penalties",
                    "https://xcancel.com/Simon_Hypixel/status/2006811903113204061?s=20"
                ]
            },
            {
                "6": [
                    "Simon - Armor Broke",
                    "https://xcancel.com/Simon_Hypixel/status/2006863388421533718?s=20"
                ]
            },
            {
                "7": [
                    "Simon - Additional Weapons",
                    "https://xcancel.com/Simon_Hypixel/status/2006936432108241362?s=20"
                ]
            },
            {
                "8": [
                    "Simon - Enchantments/Improvements",
                    "https://xcancel.com/Simon_Hypixel/status/2006937939071377631?s=20"
                ]
            },
            {
                "9": [
                    "Simon - Stagger System",
                    "https://xcancel.com/Simon_Hypixel/status/2006818179990077670?s=20"
                ]
            },
            {
                "10": [
                    "Simon - Parry System",
                    "https://xcancel.com/Simon_Hypixel/status/2006931699310145769?s=20"
                ]
            },
            {
                "11": [
                    "Simon - Grave System",
                    "https://xcancel.com/Simon_Hypixel/status/2006934146720083984?s=20"
                ]
            }
        ]
    },
    {
        "mainPlatform": "Youtube",
        "summary": "The Hytale Team release new PVP video.",
        "mainText": "<p class='mainTextParagraph'>The Hytale Team released a look at PVP in it's early stages. Notably, the gameplay did not use potions, food, traps, blocks, or magic, with the video noting that  this is simply serving as the foundation that the team is building on.</p>",
        "date": "01 01 2026",
        "tags": [
            "Youtube",
            "Gameplay",
            "Video"
        ],
        "sources": [
            {
                "1": [
                    "YouTube -  Hytale | Early PvP Gameplay Duel/FFA",
                    "https://www.youtube.com/watch?v=BAmnC-ZEaAM"
                ]
            }
        ]
    }
]
